// 버그의 원인
// 프로그램에서 버그기 발생하는 원인은 크게 세 가지로 나눌 수 있습니다.

// 논리적인 버그
// 프로그램은 문제를 해결하기 위한 알고리즘은ㄹ 구현한 것입니다.
// 논리적인 버그는 프로그램의 바탕이되는 알고리즘 자체에 오류가 있거나 알고리즘을 프로그램으로 구현하는 방법이 잘못되었을 때 발생합니다.
// 후자에는 프로그래밍 언어의 문법을 충분히 이해하지 못한 경우도 포함됩니다.

// 오타
// 오타는 개발자가 의도하지 않은 동작을 유발합니다.
// 작은 오타도 프로그램에 심각한 오류를 발생시킬 가능성이 있습니다.
// 예를 들어 if(a==b){...}로 작성해야 하는 코드를 실수로 등호를 하나만 입력해서 if(a=b)로 작성하면 오류는 발생하지 않지만 전혀 다른 동작을 하게됩니다.

// 샐행 환경의 변화
// 컴퓨터, OS, 프로그래밍 언어 자체의 사양이 바뀌어 프로그램이 동작하지 않는 경우도 있습니다.
// 원래 이러한 상황은 버그가 아니지만 프로그램이 동작하지 않는 원인을 찾아 수정해야합니다.

